---
kind: method
id: M:Autodesk.Revit.DB.ImportOptions3DM.#ctor(Autodesk.Revit.DB.ImportOptions3DM)
source: html/1b41a9db-a87a-accb-96e5-4d11647876ab.htm
---
# Autodesk.Revit.DB.ImportOptions3DM.#ctor Method

Constructs a new instance of ImportOptions3DM as a copy of the provided import options.

## Syntax (C#)
```csharp
public ImportOptions3DM(
	ImportOptions3DM option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.ImportOptions3DM`) - The 3DM import options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null